a2/app/views/messages/update.js.erb

<% @newMessages.reverse.each do |message| %>
	$("div").first().before($("<div class='message'><div class='content'><%= message.content %></div><div class='meta'><b><%= message.username %></b>, submitted <%= time_ago_in_words(message.updated_at) %> ago.</div></div>").fadeIn());
---
SELECT "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT 1