a2/app/controllers/messages_controller.rb

  def index
  	if params[:id]
      @newMessages = Message.where("id > ?", params[:id])
  		render "update"
  	else
  		@messages = Message.all
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = 21
SELECT "messages".* FROM "messages" ORDER BY "messages"."id" DESC LIMIT 1

  def create
	@message = Message.new(message_params)
	if @message.save
---
INSERT INTO "messages" ("active", "app_id", "content", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)  [["active", true], ["app_id", 1], ["content", "Hello"], ["created_at", Wed, 09 Oct 2013 23:20:20 UTC +00:00], ["updated_at", Wed, 09 Oct 2013 23:20:20 UTC +00:00], ["username", "britney"]]

  def show
  	@message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT 1  [["id", :id]]